pesp-jboss/cms-external-sources/tests/test_files/soap/CHI_testSearchBySoundex_invalid_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.services.screening.medicaid.gov/">
   <soapenv:Header/>
   <soapenv:Body>
      <impl:searchBySoundingLikeLastName>
         <arg0>
            <firstName>jones</firstName>
         </arg0>
      </impl:searchBySoundingLikeLastName>
   </soapenv:Body>
</soapenv:Envelope>